; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 tile_0-4 tile_0-5 
           tile_1-1 tile_1-2 tile_1-3 tile_1-4 tile_1-5 
           tile_2-1 tile_2-2 tile_2-3 tile_2-4 tile_2-5 
           tile_3-1 tile_3-2 tile_3-3 tile_3-4 tile_3-5 
           tile_4-1 tile_4-2 tile_4-3 tile_4-4 tile_4-5 
           tile_5-1 tile_5-2 tile_5-3 tile_5-4 tile_5-5 
           tile_6-1 tile_6-2 tile_6-3 tile_6-4 tile_6-5 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_2-2)
   (robot-has robot1 white)
   (robot-at robot2 tile_3-5)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_0-3)
   (clear tile_0-4)
   (clear tile_0-5)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_1-3)
   (clear tile_1-4)
   (clear tile_1-5)
   (clear tile_2-1)
   (clear tile_2-3)
   (clear tile_2-4)
   (clear tile_2-5)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_3-3)
   (clear tile_3-4)
   (clear tile_4-1)
   (clear tile_4-2)
   (clear tile_4-3)
   (clear tile_4-4)
   (clear tile_4-5)
   (clear tile_5-1)
   (clear tile_5-2)
   (clear tile_5-3)
   (clear tile_5-4)
   (clear tile_5-5)
   (clear tile_6-1)
   (clear tile_6-2)
   (clear tile_6-3)
   (clear tile_6-4)
   (clear tile_6-5)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_1-4 tile_0-4)
   (up tile_1-5 tile_0-5)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_2-4 tile_1-4)
   (up tile_2-5 tile_1-5)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (up tile_3-4 tile_2-4)
   (up tile_3-5 tile_2-5)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_4-3 tile_3-3)
   (up tile_4-4 tile_3-4)
   (up tile_4-5 tile_3-5)
   (up tile_5-1 tile_4-1)
   (up tile_5-2 tile_4-2)
   (up tile_5-3 tile_4-3)
   (up tile_5-4 tile_4-4)
   (up tile_5-5 tile_4-5)
   (up tile_6-1 tile_5-1)
   (up tile_6-2 tile_5-2)
   (up tile_6-3 tile_5-3)
   (up tile_6-4 tile_5-4)
   (up tile_6-5 tile_5-5)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_0-4 tile_1-4)
   (down tile_0-5 tile_1-5)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_1-4 tile_2-4)
   (down tile_1-5 tile_2-5)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (down tile_2-4 tile_3-4)
   (down tile_2-5 tile_3-5)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_3-3 tile_4-3)
   (down tile_3-4 tile_4-4)
   (down tile_3-5 tile_4-5)
   (down tile_4-1 tile_5-1)
   (down tile_4-2 tile_5-2)
   (down tile_4-3 tile_5-3)
   (down tile_4-4 tile_5-4)
   (down tile_4-5 tile_5-5)
   (down tile_5-1 tile_6-1)
   (down tile_5-2 tile_6-2)
   (down tile_5-3 tile_6-3)
   (down tile_5-4 tile_6-4)
   (down tile_5-5 tile_6-5)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_0-4 tile_0-3)
   (right tile_0-5 tile_0-4)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_1-4 tile_1-3)
   (right tile_1-5 tile_1-4)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_2-4 tile_2-3)
   (right tile_2-5 tile_2-4)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (right tile_3-4 tile_3-3)
   (right tile_3-5 tile_3-4)
   (right tile_4-2 tile_4-1)
   (right tile_4-3 tile_4-2)
   (right tile_4-4 tile_4-3)
   (right tile_4-5 tile_4-4)
   (right tile_5-2 tile_5-1)
   (right tile_5-3 tile_5-2)
   (right tile_5-4 tile_5-3)
   (right tile_5-5 tile_5-4)
   (right tile_6-2 tile_6-1)
   (right tile_6-3 tile_6-2)
   (right tile_6-4 tile_6-3)
   (right tile_6-5 tile_6-4)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_0-3 tile_0-4)
   (left tile_0-4 tile_0-5)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_1-3 tile_1-4)
   (left tile_1-4 tile_1-5)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_2-3 tile_2-4)
   (left tile_2-4 tile_2-5)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
   (left tile_3-3 tile_3-4)
   (left tile_3-4 tile_3-5)
   (left tile_4-1 tile_4-2)
   (left tile_4-2 tile_4-3)
   (left tile_4-3 tile_4-4)
   (left tile_4-4 tile_4-5)
   (left tile_5-1 tile_5-2)
   (left tile_5-2 tile_5-3)
   (left tile_5-3 tile_5-4)
   (left tile_5-4 tile_5-5)
   (left tile_6-1 tile_6-2)
   (left tile_6-2 tile_6-3)
   (left tile_6-3 tile_6-4)
   (left tile_6-4 tile_6-5)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_1-4 black)
    (painted tile_1-5 white)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_2-4 white)
    (painted tile_2-5 black)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
    (painted tile_3-4 black)
    (painted tile_3-5 white)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_4-4 white)
    (painted tile_4-5 black)
    (painted tile_5-1 white)
    (painted tile_5-2 black)
    (painted tile_5-3 white)
    (painted tile_5-4 black)
    (painted tile_5-5 white)
    (painted tile_6-1 black)
    (painted tile_6-2 white)
    (painted tile_6-3 black)
    (painted tile_6-4 white)
    (painted tile_6-5 black)
))
 (:metric minimize (total-cost))
)

; plan
1. (up robot1 tile_2-2 tile_3-2)
   deleted: (robot-at robot1 tile_2-2) (clear tile_3-2)
   added: (robot-at robot1 tile_3-2) (clear tile_2-2)
   goals met: 0 of 30
2. (up robot1 tile_3-2 tile_4-2)
   deleted: (robot-at robot1 tile_3-2) (clear tile_4-2)
   added: (robot-at robot1 tile_4-2) (clear tile_3-2)
   goals met: 0 of 30
3. (up robot1 tile_4-2 tile_5-2)
   deleted: (robot-at robot1 tile_4-2) (clear tile_5-2)
   added: (robot-at robot1 tile_5-2) (clear tile_4-2)
   goals met: 0 of 30
4. (paint-up robot1 tile_6-2 tile_5-2 white)
   deleted: (clear tile_6-2)
   added: (painted tile_6-2 white)
   goals met: 1 of 30
5. (right robot1 tile_5-2 tile_5-3)
   deleted: (robot-at robot1 tile_5-2) (clear tile_5-3)
   added: (robot-at robot1 tile_5-3) (clear tile_5-2)
   goals met: 1 of 30
6. (right robot1 tile_5-3 tile_5-4)
   deleted: (robot-at robot1 tile_5-3) (clear tile_5-4)
   added: (robot-at robot1 tile_5-4) (clear tile_5-3)
   goals met: 1 of 30
7. (paint-up robot1 tile_6-4 tile_5-4 white)
   deleted: (clear tile_6-4)
   added: (painted tile_6-4 white)
   goals met: 2 of 30
8. (right robot1 tile_5-4 tile_5-5)
   deleted: (robot-at robot1 tile_5-4) (clear tile_5-5)
   added: (robot-at robot1 tile_5-5) (clear tile_5-4)
   goals met: 2 of 30
9. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 2 of 30
10. (paint-up robot1 tile_6-5 tile_5-5 black)
   deleted: (clear tile_6-5)
   added: (painted tile_6-5 black)
   goals met: 3 of 30
11. (down robot1 tile_5-5 tile_4-5)
   deleted: (robot-at robot1 tile_5-5) (clear tile_4-5)
   added: (robot-at robot1 tile_4-5) (clear tile_5-5)
   goals met: 3 of 30
12. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 3 of 30
13. (paint-up robot1 tile_5-5 tile_4-5 white)
   deleted: (clear tile_5-5)
   added: (painted tile_5-5 white)
   goals met: 4 of 30
14. (left robot1 tile_4-5 tile_4-4)
   deleted: (robot-at robot1 tile_4-5) (clear tile_4-4)
   added: (robot-at robot1 tile_4-4) (clear tile_4-5)
   goals met: 4 of 30
15. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 30
16. (paint-up robot1 tile_5-4 tile_4-4 black)
   deleted: (clear tile_5-4)
   added: (painted tile_5-4 black)
   goals met: 5 of 30
17. (left robot1 tile_4-4 tile_4-3)
   deleted: (robot-at robot1 tile_4-4) (clear tile_4-3)
   added: (robot-at robot1 tile_4-3) (clear tile_4-4)
   goals met: 5 of 30
18. (up robot1 tile_4-3 tile_5-3)
   deleted: (robot-at robot1 tile_4-3) (clear tile_5-3)
   added: (robot-at robot1 tile_5-3) (clear tile_4-3)
   goals met: 5 of 30
19. (paint-up robot1 tile_6-3 tile_5-3 black)
   deleted: (clear tile_6-3)
   added: (painted tile_6-3 black)
   goals met: 6 of 30
20. (left robot1 tile_5-3 tile_5-2)
   deleted: (robot-at robot1 tile_5-3) (clear tile_5-2)
   added: (robot-at robot1 tile_5-2) (clear tile_5-3)
   goals met: 6 of 30
21. (down robot1 tile_5-2 tile_4-2)
   deleted: (robot-at robot1 tile_5-2) (clear tile_4-2)
   added: (robot-at robot1 tile_4-2) (clear tile_5-2)
   goals met: 6 of 30
22. (paint-up robot1 tile_5-2 tile_4-2 black)
   deleted: (clear tile_5-2)
   added: (painted tile_5-2 black)
   goals met: 7 of 30
23. (left robot1 tile_4-2 tile_4-1)
   deleted: (robot-at robot1 tile_4-2) (clear tile_4-1)
   added: (robot-at robot1 tile_4-1) (clear tile_4-2)
   goals met: 7 of 30
24. (up robot1 tile_4-1 tile_5-1)
   deleted: (robot-at robot1 tile_4-1) (clear tile_5-1)
   added: (robot-at robot1 tile_5-1) (clear tile_4-1)
   goals met: 7 of 30
25. (paint-up robot2 tile_4-5 tile_3-5 black)
   deleted: (clear tile_4-5)
   added: (painted tile_4-5 black)
   goals met: 8 of 30
26. (paint-up robot1 tile_6-1 tile_5-1 black)
   deleted: (clear tile_6-1)
   added: (painted tile_6-1 black)
   goals met: 9 of 30
27. (down robot1 tile_5-1 tile_4-1)
   deleted: (robot-at robot1 tile_5-1) (clear tile_4-1)
   added: (robot-at robot1 tile_4-1) (clear tile_5-1)
   goals met: 9 of 30
28. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 9 of 30
29. (paint-up robot1 tile_5-1 tile_4-1 white)
   deleted: (clear tile_5-1)
   added: (painted tile_5-1 white)
   goals met: 10 of 30
30. (down robot1 tile_4-1 tile_3-1)
   deleted: (robot-at robot1 tile_4-1) (clear tile_3-1)
   added: (robot-at robot1 tile_3-1) (clear tile_4-1)
   goals met: 10 of 30
31. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 30
32. (paint-up robot1 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 11 of 30
33. (down robot1 tile_3-1 tile_2-1)
   deleted: (robot-at robot1 tile_3-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_3-1)
   goals met: 11 of 30
34. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 11 of 30
35. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 12 of 30
36. (down robot1 tile_2-1 tile_1-1)
   deleted: (robot-at robot1 tile_2-1) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_2-1)
   goals met: 12 of 30
37. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 12 of 30
38. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 13 of 30
39. (down robot2 tile_3-5 tile_2-5)
   deleted: (robot-at robot2 tile_3-5) (clear tile_2-5)
   added: (robot-at robot2 tile_2-5) (clear tile_3-5)
   goals met: 13 of 30
40. (down robot1 tile_1-1 tile_0-1)
   deleted: (robot-at robot1 tile_1-1) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_1-1)
   goals met: 13 of 30
41. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 13 of 30
42. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 13 of 30
43. (paint-up robot1 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 14 of 30
44. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 14 of 30
45. (paint-up robot2 tile_3-5 tile_2-5 white)
   deleted: (clear tile_3-5)
   added: (painted tile_3-5 white)
   goals met: 15 of 30
46. (left robot2 tile_2-5 tile_2-4)
   deleted: (robot-at robot2 tile_2-5) (clear tile_2-4)
   added: (robot-at robot2 tile_2-4) (clear tile_2-5)
   goals met: 15 of 30
47. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 15 of 30
48. (up robot2 tile_2-4 tile_3-4)
   deleted: (robot-at robot2 tile_2-4) (clear tile_3-4)
   added: (robot-at robot2 tile_3-4) (clear tile_2-4)
   goals met: 15 of 30
49. (paint-up robot2 tile_4-4 tile_3-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 16 of 30
50. (left robot2 tile_3-4 tile_3-3)
   deleted: (robot-at robot2 tile_3-4) (clear tile_3-3)
   added: (robot-at robot2 tile_3-3) (clear tile_3-4)
   goals met: 16 of 30
51. (left robot2 tile_3-3 tile_3-2)
   deleted: (robot-at robot2 tile_3-3) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_3-3)
   goals met: 16 of 30
52. (paint-up robot2 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 17 of 30
53. (right robot2 tile_3-2 tile_3-3)
   deleted: (robot-at robot2 tile_3-2) (clear tile_3-3)
   added: (robot-at robot2 tile_3-3) (clear tile_3-2)
   goals met: 17 of 30
54. (up robot2 tile_3-3 tile_4-3)
   deleted: (robot-at robot2 tile_3-3) (clear tile_4-3)
   added: (robot-at robot2 tile_4-3) (clear tile_3-3)
   goals met: 17 of 30
55. (paint-up robot2 tile_5-3 tile_4-3 white)
   deleted: (clear tile_5-3)
   added: (painted tile_5-3 white)
   goals met: 18 of 30
56. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 18 of 30
57. (down robot2 tile_4-3 tile_3-3)
   deleted: (robot-at robot2 tile_4-3) (clear tile_3-3)
   added: (robot-at robot2 tile_3-3) (clear tile_4-3)
   goals met: 18 of 30
58. (paint-up robot2 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 19 of 30
59. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 19 of 30
60. (down robot2 tile_3-3 tile_2-3)
   deleted: (robot-at robot2 tile_3-3) (clear tile_2-3)
   added: (robot-at robot2 tile_2-3) (clear tile_3-3)
   goals met: 19 of 30
61. (paint-up robot2 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 20 of 30
62. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 20 of 30
63. (left robot2 tile_2-3 tile_2-2)
   deleted: (robot-at robot2 tile_2-3) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_2-3)
   goals met: 20 of 30
64. (paint-up robot2 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 21 of 30
65. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 21 of 30
66. (down robot2 tile_2-2 tile_1-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_1-2)
   added: (robot-at robot2 tile_1-2) (clear tile_2-2)
   goals met: 21 of 30
67. (paint-up robot2 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 22 of 30
68. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 22 of 30
69. (right robot2 tile_1-2 tile_1-3)
   deleted: (robot-at robot2 tile_1-2) (clear tile_1-3)
   added: (robot-at robot2 tile_1-3) (clear tile_1-2)
   goals met: 22 of 30
70. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 23 of 30
71. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 23 of 30
72. (paint-up robot2 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 24 of 30
73. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 24 of 30
74. (right robot2 tile_1-3 tile_1-4)
   deleted: (robot-at robot2 tile_1-3) (clear tile_1-4)
   added: (robot-at robot2 tile_1-4) (clear tile_1-3)
   goals met: 24 of 30
75. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 25 of 30
76. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 25 of 30
77. (right robot1 tile_0-3 tile_0-4)
   deleted: (robot-at robot1 tile_0-3) (clear tile_0-4)
   added: (robot-at robot1 tile_0-4) (clear tile_0-3)
   goals met: 25 of 30
78. (right robot2 tile_1-4 tile_1-5)
   deleted: (robot-at robot2 tile_1-4) (clear tile_1-5)
   added: (robot-at robot2 tile_1-5) (clear tile_1-4)
   goals met: 25 of 30
79. (paint-up robot2 tile_2-5 tile_1-5 black)
   deleted: (clear tile_2-5)
   added: (painted tile_2-5 black)
   goals met: 26 of 30
80. (left robot2 tile_1-5 tile_1-4)
   deleted: (robot-at robot2 tile_1-5) (clear tile_1-4)
   added: (robot-at robot2 tile_1-4) (clear tile_1-5)
   goals met: 26 of 30
81. (up robot2 tile_1-4 tile_2-4)
   deleted: (robot-at robot2 tile_1-4) (clear tile_2-4)
   added: (robot-at robot2 tile_2-4) (clear tile_1-4)
   goals met: 26 of 30
82. (paint-up robot2 tile_3-4 tile_2-4 black)
   deleted: (clear tile_3-4)
   added: (painted tile_3-4 black)
   goals met: 27 of 30
83. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 27 of 30
84. (down robot2 tile_2-4 tile_1-4)
   deleted: (robot-at robot2 tile_2-4) (clear tile_1-4)
   added: (robot-at robot2 tile_1-4) (clear tile_2-4)
   goals met: 27 of 30
85. (paint-up robot2 tile_2-4 tile_1-4 white)
   deleted: (clear tile_2-4)
   added: (painted tile_2-4 white)
   goals met: 28 of 30
86. (right robot2 tile_1-4 tile_1-5)
   deleted: (robot-at robot2 tile_1-4) (clear tile_1-5)
   added: (robot-at robot2 tile_1-5) (clear tile_1-4)
   goals met: 28 of 30
87. (down robot2 tile_1-5 tile_0-5)
   deleted: (robot-at robot2 tile_1-5) (clear tile_0-5)
   added: (robot-at robot2 tile_0-5) (clear tile_1-5)
   goals met: 28 of 30
88. (paint-up robot1 tile_1-4 tile_0-4 black)
   deleted: (clear tile_1-4)
   added: (painted tile_1-4 black)
   goals met: 29 of 30
89. (paint-up robot2 tile_1-5 tile_0-5 white)
   deleted: (clear tile_1-5)
   added: (painted tile_1-5 white)
   goals met: 30 of 30
